In [4]:
from Mypackage import module1

In [6]:
obj=module1.parent

In [7]:
obj.looks

'fair'

In [8]:
obj1=module1.child

In [10]:
obj1.behaviour

'smart behaviour'

In [11]:
obj1.work()

I am a lawyer

In [13]:
module1.factorial(7)

5040

### Pandas
- data manupulation and analysation
- uses
    -data cleaning
    -data Tranfermation
    -data analysis
- Notations
    -series
    -data frames

#Pandas series
Syntax:-pandas.series(data,index,dtype)

In [15]:
import pandas as pd
ser=pd.Series(["apple",12,10.5])
ser

0    apple
1       12
2     10.5
dtype: object

In [16]:
ser=pd.Series(["apple",12,10.5],index=["i","ii","iii"])
ser

i      apple
ii        12
iii     10.5
dtype: object

In [19]:
ser["iii"]

10.5

In [20]:
ser["i":]

i      apple
ii        12
iii     10.5
dtype: object

In [21]:
ser[:"ii"]

i     apple
ii       12
dtype: object

In [24]:
pd.Series(pd.date_range("01-01-2020","01-07-2020"),index=["mon","tue","wed","thur","fri","sat","sun"])

mon    2020-01-01
tue    2020-01-02
wed    2020-01-03
thur   2020-01-04
fri    2020-01-05
sat    2020-01-06
sun    2020-01-07
dtype: datetime64[ns]

In [25]:
import numpy as np
nps=pd.Series(np.arange(2,12))

In [28]:
nps=pd.Series(np.arange(2,12), index=range(202,212))

In [29]:
nps

202     2
203     3
204     4
205     5
206     6
207     7
208     8
209     9
210    10
211    11
dtype: int32

#### Pandas Dataframes
-syntax:- pd.DataFrame(data,index,colums......)

In [33]:
data=["apple","mango","grape"]
df=pd.DataFrame(data)
df

       0
0  apple
1  mango
2  grape

In [35]:
data=[["Nani",26],["yamini",24],["raj",23],["rani",25]]
df=pd.DataFrame(data,columns=["Name","age"],index=['a','b','c','d'])
df

     Name  age
a    Nani   26
b  yamini   24
c     raj   23
d    rani   25

In [41]:
dict1={"anil":1,"anu":3,"bob":5,"candy":9}
DS=pd.Series(dict1)
print(DS)
dict2={"anil":2,"anu":4,"bob":6,"candy":8}
Ddf=pd.DataFrame({"Rank":dict1,"Place":dict2})
print(Ddf)

anil     1
anu      3
bob      5
candy    9
dtype: int64
       Rank  Place
anil      1      2
anu       3      4
bob       5      6
candy     9      8

In [42]:
data1={"a":[1,2,3],"b":[2,4,5]}
df=pd.DataFrame(data1)
df

   a  b
0  1  2
1  2  4
2  3  5

In [44]:
filepath="Income.csv"
df=pd.read_csv(filepath)
df

,GEOID,State,2005,2006,2007,2008,2009,2010,2011,2012,2013
0,04000US01,Alabama,37150,37952,42212,44476,39980,40933,42590,43464,41381
1,04000US02,Alaska,55891,56418,62993,63989,61604,57848,57431,63648,61137
2,04000US04,Arizona,45245,46657,47215,46914,45739,46896,48621,47044,50602
3,04000US05,Arkansas,36658,37057,40795,39586,36538,38587,41302,39018,39919
4,04000US06,California,51755,55319,55734,57014,56134,54283,53367,57020,57528

In [45]:
df["2005"]

0    37150
1    55891
2    45245
3    36658
4    51755
Name: 2005, dtype: int64

In [53]:
df[1:4]

,GEOID,State,2005,2006,2007,2008,2009,2010,2011,2012,2013
1,04000US02,Alaska,55891,56418,62993,63989,61604,57848,57431,63648,61137
2,04000US04,Arizona,45245,46657,47215,46914,45739,46896,48621,47044,50602
3,04000US05,Arkansas,36658,37057,40795,39586,36538,38587,41302,39018,39919

In [62]:
df[["State","2005","2006"]]

        State   2005   2006
0     Alabama  37150  37952
1      Alaska  55891  56418
2     Arizona  45245  46657
3    Arkansas  36658  37057
4  California  51755  55319